Revit 2027 API
TextNode.IsItalic Property
 Indicates whether the default formatting is set to italic text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsItalic { get; }
Public ReadOnly Property IsItalic As Boolean
	Get
public:
property bool IsItalic {
	bool get ();
}
member IsItalic : bool with get
Property Value
Boolean
See Also
Reference
TextNode Class
Autodesk.Revit.DB Namespace